coynebp/sel_voltage_monitor/SELVoltageMonitor/SELVoltageMonitor.cydsn/Generated_Source/PSoC6/BLE_config.c
static const cy_stc_ble_gaps_t cy_ble_gaps =
{
    0x0001u,    /* Handle of the GAP service */
    0x0003u,    /* Handle of the Device Name characteristic */
    0x0005u,    /* Handle of the Appearance characteristic */
    0x0007u,    /* Handle of the Peripheral Preferred Connection Parameters characteristic */
    0x0009u,    /* Handle of the Central Address Resolution characteristic */
    0x000Bu,    /* Handle of the Resolvable Private Address Only characteristic */
};
static uint8_t cy_ble_attValues[0x0244u] = {
    /* Device Name */
    (uint8_t)'S', (uint8_t)'E', (uint8_t)'L', (uint8_t)' ', (uint8_t)'V', (uint8_t)'o', (uint8_t)'l', (uint8_t)'t',
(uint8_t)'a', (uint8_t)'g', (uint8_t)'e', (uint8_t)' ', (uint8_t)'M', (uint8_t)'o', (uint8_t)'n', (uint8_t)'i',
(uint8_t)'t', (uint8_t)'o', (uint8_t)'r', 

    /* Appearance */
    0x00u, 0x00u, 

    /* Peripheral Preferred Connection Parameters */
    0x06u, 0x00u, 0x28u, 0x00u, 0x00u, 0x00u, 0xE8u, 0x03u, 

    /* Central Address Resolution */
    0x00u, 

    /* Resolvable Private Address Only */
    0x00u, 

    /* Service Changed */
    0x00u, 0x00u, 0x00u, 0x00u, 

    /* Current Voltage */
    0x45u, 0x23u, 

    /* Characteristic User Description */
    (uint8_t)'C', (uint8_t)'u', (uint8_t)'r', (uint8_t)'r', (uint8_t)'e', (uint8_t)'n', (uint8_t)'t', (uint8_t)' ',
(uint8_t)'M', (uint8_t)'e', (uint8_t)'a', (uint8_t)'s', (uint8_t)'u', (uint8_t)'r', (uint8_t)'e', (uint8_t)'d',
(uint8_t)' ', (uint8_t)'V', (uint8_t)'o', (uint8_t)'l', (uint8_t)'t', (uint8_t)'a', (uint8_t)'g', (uint8_t)'e', 

    /* Event */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 

    /* Characteristic User Description */
    (uint8_t)'N', (uint8_t)'e', (uint8_t)'x', (uint8_t)'t', (uint8_t)' ', (uint8_t)'o', (uint8_t)'v', (uint8_t)'e',
(uint8_t)'r', (uint8_t)'/', (uint8_t)'u', (uint8_t)'n', (uint8_t)'d', (uint8_t)'e', (uint8_t)'r', (uint8_t)'v',
(uint8_t)'o', (uint8_t)'l', (uint8_t)'t', (uint8_t)'a', (uint8_t)'g', (uint8_t)'e', (uint8_t)' ', (uint8_t)'e',
(uint8_t)'v', (uint8_t)'e', (uint8_t)'n', (uint8_t)'t', (uint8_t)' ', (uint8_t)'t', (uint8_t)'o', (uint8_t)' ',
(uint8_t)'b', (uint8_t)'e', (uint8_t)' ', (uint8_t)'r', (uint8_t)'e', (uint8_t)'a', (uint8_t)'d', 

    /* Event Number */
    0x00u, 

    /* Characteristic User Description */
    (uint8_t)'W', (uint8_t)'r', (uint8_t)'i', (uint8_t)'t', (uint8_t)'e', (uint8_t)' ', (uint8_t)'a', (uint8_t)'n',
(uint8_t)' ', (uint8_t)'e', (uint8_t)'v', (uint8_t)'e', (uint8_t)'n', (uint8_t)'t', (uint8_t)' ', (uint8_t)'n',
(uint8_t)'u', (uint8_t)'m', (uint8_t)'b', (uint8_t)'e', (uint8_t)'r', (uint8_t)' ', (uint8_t)'t', (uint8_t)'o',
(uint8_t)' ', (uint8_t)'r', (uint8_t)'e', (uint8_t)'t', (uint8_t)'r', (uint8_t)'e', (uint8_t)'i', (uint8_t)'v',
(uint8_t)'e', (uint8_t)' ', (uint8_t)'t', (uint8_t)'h', (uint8_t)'a', (uint8_t)'t', (uint8_t)' ', (uint8_t)'e',
(uint8_t)'v', (uint8_t)'e', (uint8_t)'n', (uint8_t)' ', (uint8_t)'a', (uint8_t)'n', (uint8_t)'d', (uint8_t)' ',
(uint8_t)'p', (uint8_t)'l', (uint8_t)'a', (uint8_t)'c', (uint8_t)'e', (uint8_t)' ', (uint8_t)'i', (uint8_t)'t',
(uint8_t)' ', (uint8_t)'i', (uint8_t)'n', (uint8_t)' ', (uint8_t)'E', (uint8_t)'v', (uint8_t)'e', (uint8_t)'n',
(uint8_t)'t', (uint8_t)' ', (uint8_t)'c', (uint8_t)'h', (uint8_t)'a', (uint8_t)'r', (uint8_t)'a', (uint8_t)'c',
(uint8_t)'t', (uint8_t)'e', (uint8_t)'r', (uint8_t)'i', (uint8_t)'s', (uint8_t)'t', (uint8_t)'i', (uint8_t)'c', 

    /* Number of Events */
    0x0Au, 

    /* Characteristic User Description */
    (uint8_t)'N', (uint8_t)'u', (uint8_t)'m', (uint8_t)'b', (uint8_t)'e', (uint8_t)'r', (uint8_t)' ', (uint8_t)'o',
(uint8_t)'f', (uint8_t)' ', (uint8_t)'e', (uint8_t)'v', (uint8_t)'e', (uint8_t)'n', (uint8_t)'t', (uint8_t)'s',
(uint8_t)' ', (uint8_t)'s', (uint8_t)'t', (uint8_t)'i', (uint8_t)'l', (uint8_t)'l', (uint8_t)' ', (uint8_t)'t',
(uint8_t)'o', (uint8_t)' ', (uint8_t)'r', (uint8_t)'e', (uint8_t)'a', (uint8_t)'d', 

    /* Upper Threshold */
    0x39u, 0x00u, 

    /* Characteristic User Description */
    (uint8_t)'U', (uint8_t)'p', (uint8_t)'p', (uint8_t)'e', (uint8_t)'r', (uint8_t)' ', (uint8_t)'V', (uint8_t)'o',
(uint8_t)'l', (uint8_t)'t', (uint8_t)'a', (uint8_t)'g', (uint8_t)'e', (uint8_t)' ', (uint8_t)'T', (uint8_t)'h',
(uint8_t)'r', (uint8_t)'e', (uint8_t)'s', (uint8_t)'h', (uint8_t)'o', (uint8_t)'l', (uint8_t)'d', 

    /* Lower Threshold */
    0x2Bu, 0x00u, 

