coynebp/sel_voltage_monitor/SELVoltageMonitor/SELVoltageMonitor.cydsn/Generated_Source/PSoC6/BLE_config.c
    /* Characteristic User Description */
    (uint8_t)'L', (uint8_t)'o', (uint8_t)'w', (uint8_t)'e', (uint8_t)'r', (uint8_t)' ', (uint8_t)'V', (uint8_t)'o',
(uint8_t)'l', (uint8_t)'t', (uint8_t)'a', (uint8_t)'g', (uint8_t)'e', (uint8_t)' ', (uint8_t)'T', (uint8_t)'h',
(uint8_t)'r', (uint8_t)'e', (uint8_t)'s', (uint8_t)'h', (uint8_t)'o', (uint8_t)'l', (uint8_t)'d', 

    /* Trigger */
    0x00u, 

    /* Characteristic User Description */
    (uint8_t)'W', (uint8_t)'r', (uint8_t)'i', (uint8_t)'t', (uint8_t)'e', (uint8_t)' ', (uint8_t)'a', (uint8_t)' ',
(uint8_t)'1', (uint8_t)' ', (uint8_t)'t', (uint8_t)'o', (uint8_t)' ', (uint8_t)'t', (uint8_t)'r', (uint8_t)'i',
(uint8_t)'g', (uint8_t)'g', (uint8_t)'e', (uint8_t)'r', (uint8_t)' ', (uint8_t)'a', (uint8_t)'n', (uint8_t)' ',
(uint8_t)'e', (uint8_t)'v', (uint8_t)'e', (uint8_t)'n', (uint8_t)'t', 

};
#if(CY_BLE_GATT_DB_CCCD_COUNT != 0u)
static uint8_t cy_ble_attValuesCCCD[CY_BLE_GATT_DB_CCCD_COUNT];
#endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */

static const uint8_t cy_ble_attUuid128[][16u] = {
    /* Voltage Monitor */
    { 0xFBu, 0x34u, 0x9Bu, 0x5Fu, 0x80u, 0x00u, 0x00u, 0x80u, 0x00u, 0x10u, 0x00u, 0x00u, 0xE7u, 0x92u, 0xCFu, 0x7Du },
    /* Current Voltage */
    { 0xFBu, 0x34u, 0x9Bu, 0x5Fu, 0x80u, 0x00u, 0x00u, 0x80u, 0x00u, 0x10u, 0x00u, 0x00u, 0x5Bu, 0xF3u, 0x46u, 0x5Cu },
    /* Event */
    { 0xFBu, 0x34u, 0x9Bu, 0x5Fu, 0x80u, 0x00u, 0x00u, 0x80u, 0x00u, 0x10u, 0x00u, 0x00u, 0x95u, 0x76u, 0x2Eu, 0xDDu },
    /* Event Number */
    { 0xFBu, 0x34u, 0x9Bu, 0x5Fu, 0x80u, 0x00u, 0x00u, 0x80u, 0x00u, 0x10u, 0x00u, 0x00u, 0x23u, 0x97u, 0x59u, 0x7Du },
    /* Number of Events */
    { 0xFBu, 0x34u, 0x9Bu, 0x5Fu, 0x80u, 0x00u, 0x00u, 0x80u, 0x00u, 0x10u, 0x00u, 0x00u, 0xFAu, 0xC6u, 0xC3u, 0x3Eu },
    /* Upper Threshold */
    { 0xFBu, 0x34u, 0x9Bu, 0x5Fu, 0x80u, 0x00u, 0x00u, 0x80u, 0x00u, 0x10u, 0x00u, 0x00u, 0x4Eu, 0x18u, 0xD6u, 0x7Bu },
    /* Lower Threshold */
    { 0xFBu, 0x34u, 0x9Bu, 0x5Fu, 0x80u, 0x00u, 0x00u, 0x80u, 0x00u, 0x10u, 0x00u, 0x00u, 0x18u, 0x10u, 0xE0u, 0xE8u },
    /* Trigger */
    { 0x8Fu, 0xA0u, 0x0Cu, 0x8Cu, 0x20u, 0x49u, 0x40u, 0xAAu, 0xB6u, 0x49u, 0x0Bu, 0x54u, 0x82u, 0x74u, 0x07u, 0xE9u },
};

static cy_stc_ble_gatts_att_gen_val_len_t cy_ble_attValuesLen[0x1Du] = {
    { 0x0013u, (void *)&cy_ble_attValues[0] }, /* Device Name */
    { 0x0002u, (void *)&cy_ble_attValues[19] }, /* Appearance */
    { 0x0008u, (void *)&cy_ble_attValues[21] }, /* Peripheral Preferred Connection Parameters */
    { 0x0001u, (void *)&cy_ble_attValues[29] }, /* Central Address Resolution */
    { 0x0001u, (void *)&cy_ble_attValues[30] }, /* Resolvable Private Address Only */
    { 0x0004u, (void *)&cy_ble_attValues[31] }, /* Service Changed */
    { 0x0002u, (void *)&cy_ble_attValuesCCCD[0] }, /* Client Characteristic Configuration */
    { 0x0010u, (void *)&cy_ble_attUuid128[0] }, /* Voltage Monitor UUID */
    { 0x0010u, (void *)&cy_ble_attUuid128[1] }, /* Current Voltage UUID */
    { 0x0002u, (void *)&cy_ble_attValues[35] }, /* Current Voltage */
    { 0x0018u, (void *)&cy_ble_attValues[37] }, /* Characteristic User Description */
    { 0x0010u, (void *)&cy_ble_attUuid128[2] }, /* Event UUID */
    { 0x0120u, (void *)&cy_ble_attValues[61] }, /* Event */
    { 0x0027u, (void *)&cy_ble_attValues[349] }, /* Characteristic User Description */
    { 0x0010u, (void *)&cy_ble_attUuid128[3] }, /* Event Number UUID */
    { 0x0001u, (void *)&cy_ble_attValues[388] }, /* Event Number */
    { 0x0050u, (void *)&cy_ble_attValues[389] }, /* Characteristic User Description */
    { 0x0010u, (void *)&cy_ble_attUuid128[4] }, /* Number of Events UUID */
    { 0x0001u, (void *)&cy_ble_attValues[469] }, /* Number of Events */
    { 0x001Eu, (void *)&cy_ble_attValues[470] }, /* Characteristic User Description */
    { 0x0010u, (void *)&cy_ble_attUuid128[5] }, /* Upper Threshold UUID */
    { 0x0002u, (void *)&cy_ble_attValues[500] }, /* Upper Threshold */
    { 0x0017u, (void *)&cy_ble_attValues[502] }, /* Characteristic User Description */
    { 0x0010u, (void *)&cy_ble_attUuid128[6] }, /* Lower Threshold UUID */
    { 0x0002u, (void *)&cy_ble_attValues[525] }, /* Lower Threshold */
    { 0x0017u, (void *)&cy_ble_attValues[527] }, /* Characteristic User Description */
    { 0x0010u, (void *)&cy_ble_attUuid128[7] }, /* Trigger UUID */
    { 0x0001u, (void *)&cy_ble_attValues[550] }, /* Trigger */
    { 0x001Du, (void *)&cy_ble_attValues[551] }, /* Characteristic User Description */
};

static const cy_stc_ble_gatts_db_t cy_ble_gattDB[0x25u] = {
    { 0x0001u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x000Bu, {{0x1800u, NULL}}                           },
    { 0x0002u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0003u, {{0x2A00u, NULL}}                           },
    { 0x0003u, 0x2A00u /* Device Name                         */, 0x01020001u /* rd    */, 0x0003u, {{0x0013u, (void *)&cy_ble_attValuesLen[0]}} },
    { 0x0004u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0005u, {{0x2A01u, NULL}}                           },
    { 0x0005u, 0x2A01u /* Appearance                          */, 0x01020001u /* rd    */, 0x0005u, {{0x0002u, (void *)&cy_ble_attValuesLen[1]}} },
    { 0x0006u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0007u, {{0x2A04u, NULL}}                           },
    { 0x0007u, 0x2A04u /* Peripheral Preferred Connection Par */, 0x01020001u /* rd    */, 0x0007u, {{0x0008u, (void *)&cy_ble_attValuesLen[2]}} },
    { 0x0008u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0009u, {{0x2AA6u, NULL}}                           },
    { 0x0009u, 0x2AA6u /* Central Address Resolution          */, 0x01020001u /* rd    */, 0x0009u, {{0x0001u, (void *)&cy_ble_attValuesLen[3]}} },
    { 0x000Au, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x000Bu, {{0x2AC9u, NULL}}                           },
    { 0x000Bu, 0x2AC9u /* Resolvable Private Address Only     */, 0x01020001u /* rd    */, 0x000Bu, {{0x0001u, (void *)&cy_ble_attValuesLen[4]}} },
    { 0x000Cu, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x000Fu, {{0x1801u, NULL}}                           },
    { 0x000Du, 0x2803u /* Characteristic                      */, 0x00200001u /* ind   */, 0x000Fu, {{0x2A05u, NULL}}                           },
    { 0x000Eu, 0x2A05u /* Service Changed                     */, 0x01200000u /* ind   */, 0x000Fu, {{0x0004u, (void *)&cy_ble_attValuesLen[5]}} },
    { 0x000Fu, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x000Fu, {{0x0002u, (void *)&cy_ble_attValuesLen[6]}} },
    { 0x0010u, 0x2800u /* Primary service                     */, 0x08000001u /*       */, 0x0025u, {{0x0010u, (void *)&cy_ble_attValuesLen[7]}} },
    { 0x0011u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0013u, {{0x0010u, (void *)&cy_ble_attValuesLen[8]}} },
    { 0x0012u, 0xF35Bu /* Current Voltage                     */, 0x09020001u /* rd    */, 0x0013u, {{0x0002u, (void *)&cy_ble_attValuesLen[9]}} },
    { 0x0013u, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x0013u, {{0x0018u, (void *)&cy_ble_attValuesLen[10]}} },
    { 0x0014u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0016u, {{0x0010u, (void *)&cy_ble_attValuesLen[11]}} },
    { 0x0015u, 0x7695u /* Event                               */, 0x09020001u /* rd    */, 0x0016u, {{0x0120u, (void *)&cy_ble_attValuesLen[12]}} },
    { 0x0016u, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x0016u, {{0x0027u, (void *)&cy_ble_attValuesLen[13]}} },
    { 0x0017u, 0x2803u /* Characteristic                      */, 0x000A0001u /* rd,wr */, 0x0019u, {{0x0010u, (void *)&cy_ble_attValuesLen[14]}} },
    { 0x0018u, 0x9723u /* Event Number                        */, 0x090A0101u /* rd,wr */, 0x0019u, {{0x0001u, (void *)&cy_ble_attValuesLen[15]}} },
    { 0x0019u, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x0019u, {{0x0050u, (void *)&cy_ble_attValuesLen[16]}} },
    { 0x001Au, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Cu, {{0x0010u, (void *)&cy_ble_attValuesLen[17]}} },
    { 0x001Bu, 0xC6FAu /* Number of Events                    */, 0x09020001u /* rd    */, 0x001Cu, {{0x0001u, (void *)&cy_ble_attValuesLen[18]}} },
    { 0x001Cu, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x001Cu, {{0x001Eu, (void *)&cy_ble_attValuesLen[19]}} },
    { 0x001Du, 0x2803u /* Characteristic                      */, 0x000A0001u /* rd,wr */, 0x001Fu, {{0x0010u, (void *)&cy_ble_attValuesLen[20]}} },
    { 0x001Eu, 0x184Eu /* Upper Threshold                     */, 0x090A0101u /* rd,wr */, 0x001Fu, {{0x0002u, (void *)&cy_ble_attValuesLen[21]}} },
    { 0x001Fu, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x001Fu, {{0x0017u, (void *)&cy_ble_attValuesLen[22]}} },
    { 0x0020u, 0x2803u /* Characteristic                      */, 0x000A0001u /* rd,wr */, 0x0022u, {{0x0010u, (void *)&cy_ble_attValuesLen[23]}} },
    { 0x0021u, 0x1018u /* Lower Threshold                     */, 0x090A0101u /* rd,wr */, 0x0022u, {{0x0002u, (void *)&cy_ble_attValuesLen[24]}} },
    { 0x0022u, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x0022u, {{0x0017u, (void *)&cy_ble_attValuesLen[25]}} },
    { 0x0023u, 0x2803u /* Characteristic                      */, 0x00080001u /* wr    */, 0x0025u, {{0x0010u, (void *)&cy_ble_attValuesLen[26]}} },
    { 0x0024u, 0x7482u /* Trigger                             */, 0x09080100u /* wr    */, 0x0025u, {{0x0001u, (void *)&cy_ble_attValuesLen[27]}} },
    { 0x0025u, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x0025u, {{0x001Du, (void *)&cy_ble_attValuesLen[28]}} },
};

#endif /* (CY_BLE_GATT_ROLE_SERVER) */

/* Default device security */
#if (CY_BLE_MODE_PROFILE) 
    cy_stc_ble_gap_auth_info_t cy_ble_authInfo[0x01u] = {

    /* Security configuration 0 */
    {
        .security = (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_1 ), 
        .bonding = CY_BLE_GAP_BONDING, 
        .ekeySize = 0x10u, 
        .authErr = CY_BLE_GAP_AUTH_ERROR_NONE, 
        .pairingProperties = 0x01u, 
    },
};

#endif /* CY_BLE_MODE_PROFILE */

#if(CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)

/** Initialize BLE configuration parameters structure */
static const cy_stc_ble_params_t cy_ble_params =
{
        .txPowerLevelAdv                    = CY_BLE_LL_PWR_LVL_0_DBM,
        .txPowerLevelConn                   = CY_BLE_LL_PWR_LVL_0_DBM,

        .securityIoCapability               = CY_BLE_GAP_IOCAP_DISPLAY_ONLY,
        .securityPairingMethod              = 0x00u,
    
        .siliconDeviceAddressEnabled        = 0x01u,
    
        .gattDbIndexCount                   = 0x0025u,
};
#endif  /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL) */

cy_stc_ble_gap_bd_addr_t cy_ble_deviceAddress = {{0x00u, 0x00u, 0x00u, 0x50u, 0xA0u, 0x00u}, 0x00u };

/**
* \addtogroup group_globals
* @{
*/

/** The configuration structure for BLE */
cy_stc_ble_config_t cy_ble_config =
{
    /* Initialize the GAPP structures */
    /* Initialize the cy_stc_ble_gapp_disc_mode_info_t cy_ble_discoveryModeInfo structure */
    #if(CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
        .discoveryModeInfo = cy_ble_discoveryModeInfo,
        .gappAdvParams = cy_ble_gappAdvConfig,
    #else
        .discoveryModeInfo = NULL,
    #endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */

